---
kind: property
id: P:Autodesk.Revit.DB.RelinquishOptions.UserWorksets
source: html/3eac6440-7a8e-4dfb-2bf2-7be55ecb2488.htm
---
# Autodesk.Revit.DB.RelinquishOptions.UserWorksets Property

True means all user-created worksets owned by the current user should be relinquished.
 False means none of these are relinquished.

## Syntax (C#)
```csharp
public bool UserWorksets { get; set; }
```

## Remarks
This defaults to false in the User Interface.